/* automatically generated by rust-bindgen 0.69.4 */

#![allow(unused)]
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    const UNINIT: ::std::mem::MaybeUninit<max_align_t> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce1) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__clang_max_align_nonce2) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub type int_least64_t = i64;
pub type uint_least64_t = u64;
pub type int_fast64_t = i64;
pub type uint_fast64_t = u64;
pub type int_least32_t = i32;
pub type uint_least32_t = u32;
pub type int_fast32_t = i32;
pub type uint_fast32_t = u32;
pub type int_least16_t = i16;
pub type uint_least16_t = u16;
pub type int_fast16_t = i16;
pub type uint_fast16_t = u16;
pub type int_least8_t = i8;
pub type uint_least8_t = u8;
pub type int_fast8_t = i8;
pub type uint_fast8_t = u8;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
pub type BinaryenIndex = u32;
pub type BinaryenType = usize;
pub type BinaryenPackedType = u32;
pub type BinaryenHeapType = usize;
pub type BinaryenExpressionId = u32;
pub type BinaryenExternalKind = u32;
pub type BinaryenFeatures = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenModule {
    _unused: [u8; 0],
}
pub type BinaryenModuleRef = *mut BinaryenModule;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct BinaryenLiteral {
    pub type_: usize,
    pub __bindgen_anon_1: BinaryenLiteral__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union BinaryenLiteral__bindgen_ty_1 {
    pub i32_: i32,
    pub i64_: i64,
    pub f32_: f32,
    pub f64_: f64,
    pub v128: [u8; 16usize],
    pub func: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_BinaryenLiteral__bindgen_ty_1() {
    const UNINIT: ::std::mem::MaybeUninit<BinaryenLiteral__bindgen_ty_1> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BinaryenLiteral__bindgen_ty_1>(),
        16usize,
        concat!("Size of: ", stringify!(BinaryenLiteral__bindgen_ty_1))
    );
    assert_eq!(
        ::std::mem::align_of::<BinaryenLiteral__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(BinaryenLiteral__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(i32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).i64_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(i64_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f32_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(f32_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).f64_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(f64_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).v128) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(v128)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).func) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral__bindgen_ty_1),
            "::",
            stringify!(func)
        )
    );
}
#[test]
fn bindgen_test_layout_BinaryenLiteral() {
    const UNINIT: ::std::mem::MaybeUninit<BinaryenLiteral> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BinaryenLiteral>(),
        24usize,
        concat!("Size of: ", stringify!(BinaryenLiteral))
    );
    assert_eq!(
        ::std::mem::align_of::<BinaryenLiteral>(),
        8usize,
        concat!("Alignment of ", stringify!(BinaryenLiteral))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenLiteral),
            "::",
            stringify!(type_)
        )
    );
}
pub type BinaryenOp = i32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenExpression {
    _unused: [u8; 0],
}
pub type BinaryenExpressionRef = *mut BinaryenExpression;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenFunction {
    _unused: [u8; 0],
}
pub type BinaryenFunctionRef = *mut BinaryenFunction;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenMemory {
    _unused: [u8; 0],
}
pub type BinaryenMemoryRef = *mut BinaryenMemory;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenExport {
    _unused: [u8; 0],
}
pub type BinaryenExportRef = *mut BinaryenExport;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenGlobal {
    _unused: [u8; 0],
}
pub type BinaryenGlobalRef = *mut BinaryenGlobal;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenTag {
    _unused: [u8; 0],
}
pub type BinaryenTagRef = *mut BinaryenTag;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenTable {
    _unused: [u8; 0],
}
pub type BinaryenTableRef = *mut BinaryenTable;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenElementSegment {
    _unused: [u8; 0],
}
pub type BinaryenElementSegmentRef = *mut BinaryenElementSegment;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenBufferSizes {
    pub outputBytes: usize,
    pub sourceMapBytes: usize,
}
#[test]
fn bindgen_test_layout_BinaryenBufferSizes() {
    const UNINIT: ::std::mem::MaybeUninit<BinaryenBufferSizes> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BinaryenBufferSizes>(),
        8usize,
        concat!("Size of: ", stringify!(BinaryenBufferSizes))
    );
    assert_eq!(
        ::std::mem::align_of::<BinaryenBufferSizes>(),
        4usize,
        concat!("Alignment of ", stringify!(BinaryenBufferSizes))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).outputBytes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenBufferSizes),
            "::",
            stringify!(outputBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceMapBytes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenBufferSizes),
            "::",
            stringify!(sourceMapBytes)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct BinaryenModuleAllocateAndWriteResult {
    pub binary: *mut ::std::os::raw::c_void,
    pub binaryBytes: usize,
    pub sourceMap: *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_BinaryenModuleAllocateAndWriteResult() {
    const UNINIT: ::std::mem::MaybeUninit<BinaryenModuleAllocateAndWriteResult> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<BinaryenModuleAllocateAndWriteResult>(),
        12usize,
        concat!(
            "Size of: ",
            stringify!(BinaryenModuleAllocateAndWriteResult)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<BinaryenModuleAllocateAndWriteResult>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(BinaryenModuleAllocateAndWriteResult)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binary) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenModuleAllocateAndWriteResult),
            "::",
            stringify!(binary)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binaryBytes) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenModuleAllocateAndWriteResult),
            "::",
            stringify!(binaryBytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sourceMap) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(BinaryenModuleAllocateAndWriteResult),
            "::",
            stringify!(sourceMap)
        )
    );
}
pub type BinaryenSideEffects = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Relooper {
    _unused: [u8; 0],
}
pub type RelooperRef = *mut Relooper;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RelooperBlock {
    _unused: [u8; 0],
}
pub type RelooperBlockRef = *mut RelooperBlock;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CExpressionRunner {
    _unused: [u8; 0],
}
pub type ExpressionRunnerRef = *mut CExpressionRunner;
pub type ExpressionRunnerFlags = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TypeBuilder {
    _unused: [u8; 0],
}
pub type TypeBuilderRef = *mut TypeBuilder;
pub type TypeBuilderErrorReason = u32;
pub type BinaryenBasicHeapType = u32;
extern "C" {
    pub fn BinaryenTypeNone() -> BinaryenType;
    pub fn BinaryenTypeInt32() -> BinaryenType;
